zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1185/MIMXRT1185_cm7_COMMON.h
/* USDHC - Peripheral instance base addresses */
/** Peripheral USDHC2 base address */
#define USDHC2_BASE                              (0x42860000u)
/** Peripheral USDHC2 base pointer */
#define USDHC2                                   ((USDHC_Type *)USDHC2_BASE)
/** Array initializer of USDHC peripheral base addresses */
#define USDHC_BASE_ADDRS                         { 0u, 0u, USDHC2_BASE }
/** Array initializer of USDHC peripheral base pointers */
#define USDHC_BASE_PTRS                          { (USDHC_Type *)0u, (USDHC_Type *)0u, USDHC2 }
/** Interrupt vectors for the USDHC peripheral type */
#define USDHC_IRQS                               { NotAvail_IRQn, NotAvail_IRQn, USDHC2_IRQn }

/* VMBANDGAP - Peripheral instance base addresses */
/** Peripheral VMBANDGAP base address */
#define VMBANDGAP_BASE                           (0x44484780u)
/** Peripheral VMBANDGAP base pointer */
#define VMBANDGAP                                ((VMBANDGAP_Type *)VMBANDGAP_BASE)
/** Array initializer of VMBANDGAP peripheral base addresses */
#define VMBANDGAP_BASE_ADDRS                     { VMBANDGAP_BASE }
/** Array initializer of VMBANDGAP peripheral base pointers */
#define VMBANDGAP_BASE_PTRS                      { VMBANDGAP }

/* VREF - Peripheral instance base addresses */
/** Peripheral VREF base address */
#define VREF_BASE                                (0x42E30000u)
/** Peripheral VREF base pointer */
#define VREF                                     ((VREF_Type *)VREF_BASE)
/** Array initializer of VREF peripheral base addresses */
#define VREF_BASE_ADDRS                          { VREF_BASE }
/** Array initializer of VREF peripheral base pointers */
#define VREF_BASE_PTRS                           { VREF }

/* XBAR_NUM_OUT221 - Peripheral instance base addresses */
/** Peripheral XBAR1 base address */
#define XBAR1_BASE                               (0x42750000u)
/** Peripheral XBAR1 base pointer */
#define XBAR1                                    ((XBAR_NUM_OUT221_Type *)XBAR1_BASE)
/** Array initializer of XBAR_NUM_OUT221 peripheral base addresses */
#define XBAR_NUM_OUT221_BASE_ADDRS               { XBAR1_BASE }
/** Array initializer of XBAR_NUM_OUT221 peripheral base pointers */
#define XBAR_NUM_OUT221_BASE_PTRS                { XBAR1 }

/* XBAR_NUM_OUT32 - Peripheral instance base addresses */
/** Peripheral XBAR2 base address */
#define XBAR2_BASE                               (0x42760000u)
/** Peripheral XBAR2 base pointer */
#define XBAR2                                    ((XBAR_NUM_OUT32_Type *)XBAR2_BASE)
/** Peripheral XBAR3 base address */
#define XBAR3_BASE                               (0x42770000u)
/** Peripheral XBAR3 base pointer */
#define XBAR3                                    ((XBAR_NUM_OUT32_Type *)XBAR3_BASE)
/** Array initializer of XBAR_NUM_OUT32 peripheral base addresses */
#define XBAR_NUM_OUT32_BASE_ADDRS                { XBAR2_BASE, XBAR3_BASE }
/** Array initializer of XBAR_NUM_OUT32 peripheral base pointers */
#define XBAR_NUM_OUT32_BASE_PTRS                 { XBAR2, XBAR3 }

/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MIMXRT1185_CM7_COMMON_H_ */

